Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.21/samha0ab/atdf/ATSAMHA0G15AB.atdf
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready Interrupt Enable" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection Interrupt Enable" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready Interrupt Enable" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x20000"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x20000"/>
        </register>
        <register name="PCLKSR" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x20000"/>
        </register>
        <register name="XOSC" offset="0x10" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700" values="SYSCTRL_XOSC__GAIN"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000" values="SYSCTRL_XOSC__STARTUP"/>
        </register>
        <register name="XOSC32K" offset="0x14" rw="RW" size="2" initval="0x0080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="AAMPEN" caption="Automatic Amplitude Control Enable" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700" values="SYSCTRL_XOSC32K__STARTUP"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
        </register>
        <register name="OSC32K" offset="0x18" rw="RW" size="4" initval="0x003F0080" caption="32kHz Internal Oscillator (OSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700" values="SYSCTRL_OSC32K__STARTUP"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x7F0000"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="1" initval="0x1F" caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x1F"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
        <register name="OSC8M" offset="0x20" rw="RW" size="4" initval="0x87070382" caption="8MHz Internal Oscillator (OSC8M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="PRESC" caption="Oscillator Prescaler" mask="0x300" values="SYSCTRL_OSC8M__PRESC"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0xFFF0000"/>
          <bitfield name="FRANGE" caption="Oscillator Frequency Range" mask="0xC0000000" values="SYSCTRL_OSC8M__FRANGE"/>
        </register>
